Revit 2027 API
BuiltInFailures.LevelFailures.StoryAboveDeleted Property
 The level set as the Story Above for these levels is being deleted. This change will cause these levels to revert to the default Story Above.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StoryAboveDeleted { get; }
Public Shared ReadOnly Property StoryAboveDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StoryAboveDeleted {
	FailureDefinitionId^ get ();
}
static member StoryAboveDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LevelFailures Class
Autodesk.Revit.DB Namespace